// Завдання 1: Змінні та математичні операції Створіть дві змінні a та b.
// Присвойте їм будь-які числові значення. Виведіть у консоль результат їхньої суми, різниці, множення та ділення.
let a = 10;
let b = 30;
console.log(`a + b = ${a + b}`);
console.log(`a - b = ${a - b}`);
console.log(`a * b = ${a * b}`);
console.log(`a / b = ${a / b}`);

// Завдання 2: Робота з рядками Створіть змінні firstName та lastName.
// Об'єднайте їх у змінну fullName так, щоб між ними був пробіл (конкатенація). ' +
// 'Виведіть привітання, наприклад: "Привіт, Іван Іванов!".
let firstName = "Nick";
let lastName = "Taison";

console.log("Привіт, " + firstName + " " + lastName + "!");

// Завдання 3: Умовний оператор (if/else) Напишіть програму, яка перевіряє значення змінної age.
// Якщо значення 18 або більше, виведіть "Доступ дозволено", інакше — "Доступ заборонено".
let age = 23456;
if (age >= 18) {
    console.log("Доступ дозволено");
}
else {
    console.log("Доступ заборонено");
}

// Завдання 4: Цикл for Напишіть цикл, який виводить у консоль числа від 1 до 10.
for (let i = 1; i <= 10; i++){
    console.log(i);
}

// Завдання 5: Функції Створіть функцію square(number), яка приймає число як аргумент і повертає його квадрат
// (число, помножене на саме себе). Викличте функцію для числа 5 та виведіть результат.
function square(number){
    return number ** 2;
}

console.log(square(5));

// Завдання 6: Робота з масивами Створіть масив fruits, який містить 3 назви фруктів.
// Додайте четвертий фрукт у кінець масиву за допомогою методу .push(). Виведіть весь масив у консоль.

let fruits = ["apple", "orange", "banana"];
fruits.push("kiwi");
console.log(fruits);